# GridBankColNum Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..GridBankColNum Property
ParameterTypeId Class See Also
---
"Column"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId GridBankColNum { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property GridBankColNum As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ GridBankColNum {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace